{
    "S1.012": {
        "titre" : "Génération automatique d'un lexique pour classer des dépêches",
        "comp_tech" : ["Java"],
        "comp_PN" : ["Implémenter des conceptions simples",
                "Élaborer des conceptions simples",
                "Faire des essais et évaluer leurs résultats en regard des spécifications"],
        "info_comp" : ["<p>Dans le cadre des cours de programmation en Java, nous avons dû réaliser, en binôme, un algorithme de classification de dépêches. Celles-ci devaient être organisées dans cinq catégories : culture, sport, environnement, politique et économie.</p>",
                "<p>Nous devions donc générer des lexiques automatiques à partir d'une liste de dépêches. Ces lexiques avaient pour but d'attribuer des scores (de 1 à 3) pour chaque mot et ainsi de définir si un mot est déterminant pour une catégorie. Par exemple, le mot basket-ball valait 3 pour la catégorie sport. Ce classement nous a permis de générer un fichier de résultat et le taux de réussite de l'algorithme. En effet, nous avions un fichier qui résumait les véritables catégories de chaque dépêche, nous permettant ainsi de calculer le taux de réussite de notre classification.</p>",
                "<p><a href=\"https://github.com/dubiefe/ClassificationAutomatique\" target=\"_blank\">Pour consulter le GitHub du projet, cliquez sur ce lien.</a></p>",
                "<p>Vous pouvez consultez les classes Java dans le fichier \"src/\" du projet : </p>",
                "<p>&ensp;&ensp;- Classification.java, il s'agit du code qui permet de lire les dépêches, les trier et calculer le score. Il s'agit aussi de la classe contenant la fonction main.</p>",
                "<p>&ensp;&ensp;- Categorie.java, il s'agit de la classe Depeche qui représente un objet de type dépêche et permet d'avoir son lexique et ses scores dans chaque catégorie.</p>"]            
    },
    "S1.056": {
        "titre" : "Adaptation du site web d'une ESN pour un public précis",
        "comp_tech" : ["Whimsical","HTML","CSS"],
        "comp_PN" : ["Appréhender les besoins du client et de l'utilisateur",
                "Développer des interfaces utilisateurs",
                "Implémenter des  conceptions simples"],
        "info_comp" : ["<p>Dans le cadre d'un projet de fin de semestre, nous avons dû recréer, en équipe de quatre, le site web d'Atos à destination d'élèves de troisième à la recherche d'un stage. Il nous fallait donc simplifier le site d'origine et surtout sélectionner les informations nécessaires pour le public visé.</p>",
                "<p>Nous avons donc dans un premier temps réalisé un dossier pour établir nos besoins. Les informations importantes à relever étaient la structure de l'entreprise et son engagemenent en matière de RSE (Responsabilité Sociétale de l'Entreprise).</p>",
                "<p>Nous avons fait ensuite un wireframe de notre site en utilisant le site Whimisical.</p>",
                "<p>Puis, pendant trois jours, nous avons codé le site en autonomie. Cependant, à cause d'un manque de communication, j'ai réalisé la page d'accueil et les pages transition écologique, secteurs et valeurs seule. J'ai essayé de transmettre une image écoresponsable d'Atos en utilisant une palette de couleurs liée à l'écologie avec du vert et du marron. J'ai aussi mis l'accent sur les actions d'Atos en matière de RSE. De plus, le site a été conçu dans le but d'attirer la nouvelle génération chez Atos en mettant l'accent sur le recrutement pour des stages ou des alternances. Enfin, j'ai voulu rendre le site responsive en créant une adaptation sur petit écran, pour ce faire j'ai changé l'organisation de certaines pages et modifier la barre de navigation.</p>",
                "<p>Enfin, nous avons dû présenter le site en cinq minutes et justifier nos choix. J'ai pris la parole lors de cet oral.</p>",
                "<p><a href=\"https://dubiefe.github.io/NewAtos/index.html\" target=\"_blank\">Pour consulter le site, cliquez sur ce lien.</a></p>",
                "<p><a href=\"https://github.com/dubiefe/NewAtos\" target=\"_blank\">Pour consulter le GitHub du projet, cliquez sur ce lien.</a></p>"]            
    },
    "R2.12": {
        "titre" : "Création d'un site web en anglais",
        "comp_tech" : ["HTML","CSS"],
        "comp_PN" : ["Appréhender les besoins du client et de l'utilisateur",
                "Développer des interfaces utilisateurs",
                "Implémenter des  conceptions simples"],
        "info_comp" : ["<p>Dans le cadre d'une ressource d'anglais, nous avons appris à communiquer par mail, par téléphone et en direct pour l'avancement d'un projet. Pour ce faire, nous avons échangé avec d'autres élèves en jouant le rôle de client mais aussi de développeur.</p>",
                "<p>Nous avons donc réalisé le site web d'un restaurant asiatique fictif nommé Hanaya, dont j'ai codé la page d'accueil. J'ai aussi participé activement à la sélection des fonds et des images pour l'ensemble du site.</p>",
                "<p>Afin d'attirer les clients sur le site, nous avons choisi de mettre en avant les plats servis dans le restaurant, en mettant une image imposante qui prend les trois quarts de l'écran d'accueil. Les couleurs rouge et jaune ont aussi pour but de donner envie au client puisque ce sont des couleurs souvent utilisées en restauration.</p>",
                "<p><a href=\"https://dubiefe.github.io/Hanaya/index.html\" target=\"_blank\">Pour consulter le site, cliquez sur ce lien.</a></p>",
                "<p><a href=\"https://github.com/dubiefe/Hanaya\" target=\"_blank\">Pour consulter le GitHub du projet, cliquez sur ce lien.</a></p>"]            
    },
    "S2.04": {
        "titre" : "Étude du nutri-score d'une catégorie de produits",
        "comp_tech" : ["SQL","R"],
        "comp_PN" : ["Manipuler des données hétérogènes",
                "Mettre à jour et interroger une base de données relationnelle"],
        "info_comp" : ["<p>Dans le cadre des cours de SQL et de mathématiques, nous avons réalisé, en binôme, une étude visant à informer les consommateurs de la signification du nutri-score pour une catégorie précise de produits. Nous devions faire des recherches sur les sauces et les condiments aux États-Unis.</p>",
                "<p>Dans un premier temps, nous avons interrogé une base de données d'une taille considérable afin de la trier et de ne conserver que les informations pertinentes pour notre projet. Cette étape était assez longue puisque la base de données a été remplie de manière collaborative. Les données étaient donc parfois mal renseignées ou avec des fautes de frappes. Nous avons donc créé des vues et des tables temporaires afin de mieux filtrer et trier les données. </p>",
                "<p>Ensuite, nous avons construit en R des graphiques adaptés à nos données. Nous avons dû faire plusieurs tests afin de trouver la meilleure façon de présenter les informations prélevées. Nous devions aussi faire en sorte que nos graphiques soient accessible à un large public.</p>",
                "<p>Enfin, nous avons mis en page et commenté ces graphiques en anglais. L'étude ainsi réalisée est consultable ci-dessous :</p>",
                "<iframe src=\"Info_Projets/Documents/S2.04.pdf\" width=\"100%\" height=\"500px\"></iframe>"]            
    },
    "S2.01256": {
        "titre" : "Création d'une application pour un organisateur d'événements",
        "comp_tech" : ["UML","Whimsical","Java","FXML","CSS"],
        "comp_PN" : ["Mettre en place les outils de gestion de projet",
                "Identifier les besoins métiers des clients et des utilisateurs",
                "Développer des interfaces utilisateurs",
                "Identifier ses aptitudes pour travailler dans une équipe",
                "Élaborer et implémenter les spécifications fonctionnelles et non fonctionnelles à partir des exigences",
                "Faire des essais et évaluer leurs résultats en regard des spécifications"],
        "info_comp" : ["<p>Dans le cadre du projet de fin de première année à l'IUT, nous avons entièrement conçu une application, nommée ProEventPlanner, en équipe de six. Nous avons suivi toutes les étapes d'un projet en commençant par de la gestion de projet, puis de la conception, du développement et enfin la présentation de notre application.</p>",
                "<p>Après avoir choisi les événements d'entreprise pour notre application de gestion d'événements, nous avons rédigé un dossier de conception. Il était constitué de diagrammes UML destiné à préparer le développement de l'application. Nous avons réalisé un diagramme de cas d'utilisation dont les fonctionnalités sont détaillées. Nous avons aussi construit des diagrammes de classes et d'objets, et enfin des diagrammes de séquences. J'ai rédigé les descriptions des cas d'utilisation et j'ai mis en page le dossier final.</p>", 
                "<p>Ce dossier est consultable et téléchargeable ci-dessous :</p>",
                "<iframe src=\"Info_Projets/Documents/B1-16-dossier-conception.pdf\" width=\"100%\" height=\"500px\"></iframe>",
                "<p>Dans un second temps, nous avons entamé la phase de conception d'interface afin de définir l'esthétique de notre application. Pour cela, nous avons défini des personnas afin de connaître les besoins de nos potentiels utilisateurs. Ensuite, nous avons fait un wireframe de l'application grâce à Whimsical. Nous avons également fait attention à respecter les critères ergonomiques de Bastien & Scapin dans nos interfaces. J'ai ensuite rédigé le dossier en m'assurant que les parties faites par chacun soient cohérentes.</p>",
                "<p>Ce dossier est également consultable et téléchargeable ci-dessous :</p>",
                "<iframe src=\"Info_Projets/Documents/B1-16-dossier-IHM.pdf\" width=\"100%\" height=\"500px\"></iframe>",
                "<p>Nous avons ensuite développé l'application pendant toute une semaine en utilisant Java pour le back-end et FXML pour le front-end. Nous avons utilisé le logiciel IntellIJ. Nousavons respecté une architecture MVC pour cette application.</p>",
                "<p><a href=\"https://github.com/dubiefe/ProEventPlanner\" target=\"_blank\">Pour consulter le code du projet, cliquez sur ce lien.</a></p>",
                "<p><a class=\"lienTelechargeable\" href=\"Info_Projets/genevent.jar\" download=\"ProEventPlanner.jar\">ProEventPlanner.jar</a>, il s'agit du fichier jar de l'application.</p>",
                "<p>La dernière étape du projet fut de présenter à l'oral notre application sous forme de trois oraux :</p>",
                "<p>&ensp;&ensp;- un pitch en anglais pour faire la promotion de notre application ;</p>",
                "<p>&ensp;&ensp;- une démo pour présenter le code et le fonctionnement de l'application ;</p>", 
                "<p>&ensp;&ensp;- une présentation marketing pour vendre l'application à des investisseurs, pour laquelle nous avons réalisé le support suivant :</p>",
                "<div class=\"images\"><img src=\"Info_Projets/Documents/CanvasPEP.png\" alt=\"SupportOralDeMarketting\" width=\"50%\"></div>"]            
    },
    "S3.01": {
        "titre" : "Développement d'une application web",
        "comp_tech" : ["UML","HTML","CSS","JavaScript","PHP","SQL","Talend"],
        "comp_PN" : ["Mobiliser les compétences interpersonnelles pour travailler dans une équipe informatique",
                "Identifier ses aptitudes pour travailler dans une équipe",
                "Formaliser les besoins du client et de l'utilisateur",
                "Définir et mettre en œuvre une démarche de suivi de projet",
                "Choisir des structures de données complexes adaptées au problème",
                "Élaborer et implémenter les spécifications fonctionnelles et non fonctionnelles à partir des exigences",
                "Vérifier et valider la qualité de l’application par les tests"],
        "info_comp" : ["<p>En équipe de 7, nous avons conçu et développé une application web destiné à promouvoir le patrimoine français. Pour ce faire, nous avons réalisé une carte interractive avec un aspect communautaire afin de faire connaître les maisons d'illustres françaises.</p>",
                "<p>Ce projet s'est déroulé en trois phases sur plusieurs mois, une phase de gestion de projet, une phase de conception et une phase de développement.</p>", 
                "<p>Avant de pouvoir commencer ce projet, nous avons choisi le patrimoine pour notre application : les maisons d'illustres.</p>",
                "<h3>Phase de gestion de projet</h3>",
                "<p>Pour cette première phase, l'objectif était de nous préparer pour la suite du projet.</p>",
                "<p>Lors de cette phase, j'ai participé à plusieurs parties :</p>",
                "<p>&ensp;&ensp;- la définition des besoins fonctionnels et la construction du diagramme de cas d'utilisation;</p>",
                "<p>&ensp;&ensp;- la définition et la mise en page des personas;</p>",
                "<p>&ensp;&ensp;- la réalisation des permières maquettes en fil de fer.</p>",
                "<p>Le dossier réalisé pour cette phase est consultable et téléchargeable ci-dessous :</p>",
                "<iframe src=\"Info_Projets/Documents/NotaDomus/Doc Final GP.pdf\" width=\"100%\" height=\"500px\"></iframe>",
                "<h3>Phase de conception</h3>",
                "<p>Pour cette deuxième phase, l'objectif était de concevoir l'application avant de pouvoir commencer le développement.</p>",
                "<p>Lors de cette phase, j'ai participé à plusieurs parties :</p>",
                "<p>&ensp;&ensp;- la création des maquettes en fil de fer;</p>",
                "<p>&ensp;&ensp;- la création des diagrammes BPMN pour définir les relations entre les différents utilisateurs;</p>",
                "<p>&ensp;&ensp;- la réalisation du flux de transformation des données (ETL);</p>",
                "<p>&ensp;&ensp;- la passation d'une ballade cognitive afin d'évaluer la qualité de nos interfaces.</p>",
                "<p>Le dossier réalisé pour cette phase est consultable et téléchargeable ci-dessous :</p>",
                "<iframe src=\"Info_Projets/Documents/NotaDomus/Document_final_phase2.pdf\" width=\"100%\" height=\"500px\"></iframe>",
                "<h3>Phase de développement</h3>",
                "<p>Pour cette dernière phase, l'objectif était de développer l'application.</p>",
                "<p>Lors de cette phase, j'ai participé à plusieurs parties :</p>",
                "<p>&ensp;&ensp;- la réalisation sur Talend du flux ETL défini précédemment afin de remplir la base de données;</p>",
                "<p>&ensp;&ensp;- le développement des interfaces en HTML, CSS et Javascript;</p>",
                "<p>&ensp;&ensp;- le développement des contrôleurs en PHP;</p>",
                "<p>&ensp;&ensp;- la passation des tests utilisateurs auprès d'utilisateurs répondant à nos peronas.</p>",
                "<p>L'application ayant été hébergée sur un serveur mis à disposition par l'IUT, elle n'est plus disponible. C'est pourquoi j'ai réalisé une vidéo permettant de montrer toutes les fonctionnalités de l'application. Cette vidéo est consultable en suivant ce <a href=\"https://youtu.be/K53gx4snMG8\" target=\"_blank\">lien</a>.</p>",
                "<p>Le dossier réalisé pour cette phase est consultable et téléchargeable ci-dessous :</p>",
                "<iframe src=\"Info_Projets/Documents/NotaDomus/equipe16-rendu-phase3 (1).pdf\"></iframe>"]            
    },
    "ST4.01": {
        "titre" : "Uniformisation d'une suite d'application",
        "comp_tech" : ["PowerApps","SharePoint","PowerAutomate"],
        "comp_PN" : ["Comprendre la diversité, la structure et la dimension de l’informatique dans une organisation (ESN, DSI,...)",
                "Appliquer une démarche pour intégrer une équipe informatique au sein d’une organisation",
                "Mobiliser les compétences interpersonnelles pour travailler dans une équipe informatique",
                "Élaborer et implémenter les spécifications fonctionnelles et non fonctionnelles à partir des exigences",
                "Adopter de bonnes pratiques de conception et de programmation"],
        "info_comp" : ["<p>Lors du stage de fin de deuxième année au BUT Informatique, j'ai intégré la division en charge de l’informatique de l’entreprise TotalEnergies. Celle-ci possède une structure complexe et environ 865 employés. C’est pourquoi, une suite d’applications, développée avec l’outils PowerApps, a été mise en place pour soutenir l’organisation de cette division. </p>",
                "<p>Cependant, des nouveaux besoins apparaissent régulièrement, et donnent lieu à des modifications sur la suite. Dans l’objectif de les mettre en place, il m'a fallu effectuer une étude des applications et des outils utilisés. </p>",
                "<p>Ceci a permis, dans un premier temps, la mise en place de modifications mineures, à travers le déplacement de données, ou la revue de certaines interfaces. Dans un second temps, cela a pris la forme de modifications plus complexes, comme l’ajout d’une fonctionnalité sur toute la suite, ou l’automatisation de processus. Une fois ces modifications faîte, il fallait mettre en place des kits de déploiement à destination des autres divisions.</p>"]            
    },
    "R4.01": {
        "titre" : "Développement d'un site en Javascript - BUT 2 (2024/2025)",
        "comp_tech" : ["JavaScript","HTML","CSS","TMDB API"],
        "comp_PN" : ["Adopter de bonnes pratiques de conception et de programmation",
                "Organiser la restitution de données à travers la programmation"],
        "info_comp" : ["<p>Dans le cadre d'un cours de développement autour de JavaScript, nous avons appris les fondamentaux de ce langage.</p>",
                "<p>C'est pourquoi nous avons dû réaliser un projet final en binôme pour cette matière avec les consignes suivantes :</p>",
                "<p>&ensp;&ensp;- Utilisation de JavaScript Vanilla (aucun framework)</p>",
                "<p>&ensp;&ensp;- Communication avec une API afin d'afficher des données</p>",
                "<p>&ensp;&ensp;- Mise en place d'une architecture MVC (Model View Controler)</p>",
                "<p>Nous avons choisi d'utiliser l'API <a href=\"https://www.themoviedb.org/?language=fr\" target=\"_blank\">TMDB</a> référençant des informations générales sur des films.</p>",
                "<p>Le site comporte deux pages, l'accueil et la recherche, visibles ci-dessous:</p>",
                "<div class=\"images\"><img src=\"Info_Projets/Images/MovieNight/index.png\" alt=\"index\" width=\"40%\"><img src=\"Info_Projets/Images/MovieNight/search.png\" alt=\"search\" width=\"40%\"></div>",
                "<p>Le site que nous avons créé comporte de nombreuses fonctionnalités :</p>",
                "<p>&ensp;&ensp;- Enregistrement de favoris dans le Local Storage (espace de stockage) du navigateur</p>",
                "<p>&ensp;&ensp;- Recherche personnalisée de films avec de nombreux filtres (durée, genre, date, mots-clefs)</p>",
                "<p>&ensp;&ensp;- Recherche aléatoire de films</p>",
                "<p>Nous avons utilisé une architecture MVC pour le site, le détail de la structure du code est visible sur le GitHub du projet accessible plus bas.</p>",
                "<p><a href=\"https://jarodtivollier.github.io/Projet_API\" target=\"_blank\">Pour consulter le site, cliquez sur ce lien.</a></p>",
                "<p><a href=\"https://github.com/JarodTivollier/Projet_API\" target=\"_blank\">Pour consulter le GitHub du projet, cliquez sur ce lien.</a></p>"]             
    },
    "UT.DWC": {
        "titre" : "Développement d'un Taste Mixer avec l'API de Spotify",
        "comp_tech" : ["NextJS","Spotify API","Postman","JavaScript","HTML","CSS"],
        "comp_PN" : ["Adopter de bonnes pratiques de conception et de programmation",
                "Organiser la restitution de données à travers la programmation"],
        "info_comp" : ["<p>Dans le cadre d'un cours de développement web côté client autour des frameworks de JavaScript, nous avons appris à utiliser NextJS.</p>",
                "<p>C'est pourquoi nous avons dû réaliser un projet final individuel pour cette matière, sous la forme d'un créateur de playlists personnalisées avec les consignes suivantes :</p>",
                "<p>&ensp;&ensp;- Création d'une application NextJS avec au moins deux pages (login & création de playlists)</p>",
                "<p>&ensp;&ensp;- Communication avec l'API de Spotify pour la création de playlists</p>",
                "<p>&ensp;&ensp;- Gestion de favoris</p>",
                "<p>Concernant la façon de créer des playlists, nous avions carte blanche.</p>",
                "<p>Pour prendre en main le projet, j'ai d'abord commencé par comprendre le fonctionnement de l'API de Spotify. J'ai dû me créer un compte lié à mon compte Spotify afin de pouvoir utiliser l'API. J'ai ensuite utilisé Postman, un outil permettant de faire des requêtes HTTP, afin de comprendre le flux d'appels à faire pour chacun des cas dont j'avais besoin pour l'application.</p>",
                "<p>Une fois toutes mes requêtes prêtes, j'ai commencé à faire l'application avec NextJS. Elle est constituée de deux pages, login et création de playlists, visibles ci-dessous:</p>",
                "<div class=\"images\"><img src=\"Info_Projets/Images/SpotifyTasteMixer/login.png\" alt=\"login\" width=\"40%\"><img src=\"Info_Projets/Images/SpotifyTasteMixer/playlists.png\" alt=\"playlists\" width=\"40%\"></div>",
                "<p>L'application finale comporte de nombreuses fonctionnalités :</p>",
                "<p>&ensp;&ensp;- Enregistrement de favoris dans le Local Storage (espace de stockage) du navigateur</p>",
                "<p>&ensp;&ensp;- Création de playlists basées sur des choix d'artistes, de morceaux, d'albums et de podcasts</p>",
                "<p>&ensp;&ensp;- Ajout de musiques de Noël aux playlists</p>",
                "<p>&ensp;&ensp;- Téléchargement des playlists créées directement sur son compte Spotify</p>",
                "<p>Pour le style de l'application, j'ai privilégié des couleurs sombres accompagnées du vert officiel de Spotify. J'ai également mis du rouge pour l'ajout de musiques de Noël.</p>",
                "<p>La création de playlist est basée sur une sélection de morceaux en fonction des choix de l'utilisateur. Les morceaux choisis sont directement ajoutés à la playlist. Pour les albums, artistes et podcasts, deux morceaux sont choisis au hasard dans leur contenu. L'ajout de musique de Noël vient piocher deux musiques aléatoires dans une playlist de Noël créée par Spotify.</p>",
                "<p><a href=\"https://dubiefe-soptify-taste-mixer.vercel.app\" target=\"_blank\">Pour consulter l'application, cliquez sur ce lien.</a></p>",
                "<p><a href=\"https://github.com/dubiefe/Soptify-Taste-Mixer\" target=\"_blank\">Pour consulter le GitHub du projet, cliquez sur ce lien.</a></p>"]          
    },
    "Fleur": {
        "titre" : "Participation à une exposition d'art de mon lycée",
        "info_comp" : ["<p>Dans le cadre d'une exposition d'art organisée le 6 juin 2023 par mon lycée, j'ai créé un projet fait de papier pour répondre au thème \"La renaissance des couleurs\".</p>",
                "<p>Afin de réaliser ce projet, j'ai, dans un premier temps, fait un croquis de mes idées et réuni tout le matériel nécessaire. Puis, j'ai passé la plupart de mes soirées et tous mes week-ends à sa réalisation. Ce projet est fait exclusivement de carton, papier et colle. Les roses sont réalisées en origami et le fond en déco patch (une technique consistant à recouvrir de colle des bouts de papier et de les empiler harmonieusement afin de remplir un espace).</p>",
                "<div class=\"images\"><img src=\"Info_Projets/Images/ProjetFleur/etape1.jpg\" alt=\"etape1\" width=\"200vh\"><img src=\"Info_Projets/Images/ProjetFleur/etape2.jpg\" alt=\"etape2\" width=\"200vh\"><img src=\"Info_Projets/Images/ProjetFleur/etape3.jpg\" alt=\"etape3\" width=\"200vh\"><img src=\"Info_Projets/Images/ProjetFleur/etape4.jpg\" alt=\"etape4\" width=\"200vh\"><img src=\"Info_Projets/Images/ProjetFleur/etape5.jpg\" alt=\"etape5\" width=\"200vh\"></div>",
                "<p class=\"etape\">Étape 1 : Faire les bases des fleurs</p>",
                "<p>Cette étape consistait à faire des sortes de petits volcans gris à des endroits aléatoires de la feuille. J'ai utilisé pour cela du papier gris et du carton plutôt fin.</p>",
                "<p class=\"etape\">Étape 2 : Remplir le fond</p>",
                "<p>Cette étape consistait à recouvrir la feuille de papier noir à l'aide de la méthode de déco patch mentionnée plus tôt.</p>",
                "<p class=\"etape\">Étape 3 : Finir le fond</p>",
                "<p>Cette étape fut uniquement de découper le papier qui dépassait de la feuille.</p>",
                "<p class=\"etape\">Étape 4 : Découper les feuilles</p>",
                "<p>Cette étape était plus délicate car il me fallait découper les feuilles des roses à l'aide de petits ciseaux afin de faire de fines entailles. J'ai fait cela pour rendre les feuilles plus détaillées.</p>",
                "<p class=\"etape\">Étape 5 : Faire les fleurs</p>",
                "<p>Cette étape consistait à faire les roses avec le plus de papiers colorés différents afin de les rendre multicolores. Je les ai ensuite collées sur les petits socles gris. Une fois tout cela sec, j'étais en mesure de le fixer au mur sans que rien ne tombe.</p>",
                "<p>Enfin, ce projet a été exposé le temps d'une soirée, accompagné d'un poème que j'ai écrit moi-même pour expliquer sa signification.</p>",
                "<div class=\"images\"><img src=\"Info_Projets/Images/ProjetFleur/apercuFinal1.jpg\" alt=\"apercu1\" width=\"200vh\"><img src=\"Info_Projets/Images/ProjetFleur/apercuFinal2.jpg\" alt=\"apercu2\" width=\"200vh\"><img src=\"Info_Projets/Images/ProjetFleur/apercuFinal3.jpg\" alt=\"apercu3\" width=\"200vh\"><img src=\"Info_Projets/Images/ProjetFleur/apercuFinal4.jpg\" alt=\"apercu4\" width=\"200vh\"></div>"]
    },
    "CodeName": {
        "titre": "Développement d'une PowerApps CodeName",
        "comp_tech": ["PowerApps","SharePoint"],
        "info_comp": ["<p>Afin de me préparer à utiliser les Power outils de Microsoft pour mon stage de deuxième année à l'IUT, j'ai réalisé une PowerApp reproduisant le jeu de société Code Name. Ce projet m'a été proposé par mon maître de stage afin de m'aider à bien comprendre les mécanismes de ces outils.</p>",
                "<p>L'application fonctionne avec deux listes SharePoint permettant la sauvegarde des données des parties. L'une contient les noms et code de connexion de chaque partie. L'autre contient les détails associés à chaque partie comme les scores, et l'état de la partie en cours.</p>",
                "<p>J'ai commencé par faire une version assez basique de l'application, et j'ai demandé des retours d'une part sur le fonctionnement, de l'autre sur l'aspect visuel à une spécialiste de l'UX. Ce qui m'a permis d'améliorer le jeu.</p>",
                "<p>Afin de bien montrer ces améliorations, je vais expliquer chaque facette de l'application avant et après les retours.</p>",
                "<p class=\"etape\">Accueil de l'application</p>",
                "<p>Cette page est la première de l'application. Elle permet à l'utilisateur de se connecter à une partie déjà existante ou d'en créer une nouvelle.</p>",
                "<div class=\"images\"><img src=\"Info_Projets/Images/Code Name/Titre - V1.png\" alt=\"titrev1\" width=\"40%\"><img src=\"Info_Projets/Images/Code Name/Titre - V2.png\" alt=\"titrev2\" width=\"40%\"></div>",
                "<p>Les retours reçus sur cette page concernaient surtout l'aspect visuel. J'ai donc arrondi les boutons, réduit le texte pour alléger la page, et ajouté des indices pour les champs à remplir.</p>",
                "<p class=\"etape\">Règles et options du jeu</p>",
                "<p>Cette page est la deuxième de l'application. Elle permet à l'utilisateur de se rappeler les règles du jeu avant de commencer la partie, et de choisir son rôle dans le jeu. Afin de faciliter l'accès à ces fonctionnalités, je les ai également ajoutées plus tard dans la page du jeu.</p>",
                "<div class=\"images\"><img src=\"Info_Projets/Images/Code Name/Règles - V1.png\" alt=\"reglesv1\" width=\"40%\"><img src=\"Info_Projets/Images/Code Name/Règles - V2.png\" alt=\"reglesv2\" width=\"40%\"></div>",
                "<p>Les retours reçus sur cette page concernaient l'organisation des éléments sur la page, et la mise en valeur des règles. J'ai donc séparé l'écran en deux afin d'éviter le découpage des informations en bas de la page. J'ai ensuite mis en avant les règles en les simplifiant et en mettant en avant les informations importantes.</p>",
                "<div class=\"images\"><img src=\"Info_Projets/Images/Code Name/Options - V2.png\" alt=\"optionsv2\" width=\"40%\"><img src=\"Info_Projets/Images/Code Name/Règles - V3.png\" alt=\"reglesv3\" width=\"40%\"></div>",
                "<p>Après l'amélioration de la page, j'ai pris la décision d'aider l'utilisateur en mettant ces informations également sur la page de jeu. Les rôles et les règles sont alors regroupés dans un onglet \"Informations\". J'ai également mieux développé les règles selon le rôle de l'utilisateur.</p>",
                "<p class=\"etape\">Tour de jeu</p>",
                "<p>Cette page est la dernière de l'application. Elle permet à l'utilisateur de jouer une partie. Deux vues sont disponibles, celle de l'agent et celle de l'espion.</p>",
                "<div class=\"images\"><img src=\"Info_Projets/Images/Code Name/TourAgent - V1.png\" alt=\"agentv1\" width=\"40%\"><img src=\"Info_Projets/Images/Code Name/TourAgent - V2.png\" alt=\"agentv2\" width=\"40%\"></div>",
                "<div class=\"images\"><img src=\"Info_Projets/Images/Code Name/TourEspion - V1.png\" alt=\"espionv1\" width=\"40%\"><img src=\"Info_Projets/Images/Code Name/TourEspion - V2.png\" alt=\"espionv2\" width=\"40%\"></div>",
                "<p>Sur ces deux vues, les retours ont été centrés sur deux aspects :</p>",
                "<p>&ensp;&ensp;- La présence trop importante de texte explicatif;</p>",
                "<p>&ensp;&ensp;- Le visuel des cartes.</p>",
                "<p>J'ai donc commencé par ajouter une section sur la gauche indiquant visuellement les tours, les mots restants et les scores. L'indication de l'équipe du joueur est aussi indiquée par le texte \"EUX\" et \"NOUS\". J'ai ensuite revu le visuel des cartes en les arrondissant et en enlevant le cadre qui les alourdissait.</p>",
                "<p class=\"etape\">Ajout de fonctionnalités</p>",
                "<p>Après les retours reçus, j'ai aussi effectué des ajouts dans l'application.</p>",
                "<p>Par exemple, j'ai ajouté une aide qui s'ouvre au démarrage de la partie. Celle-ci permet à l'utilisateur de voir le déroulement d'une partie et ainsi de mieux comprendre les règles.</p>",
                "<div class=\"images\"><img src=\"Info_Projets/Images/Code Name/Aide - V1.png\" alt=\"aidev1\" width=\"40%\"></div>",
                "<p class=\"etape\">Téléchargement de l'application</p>",
                "<p>Lors de mon stage j'ai eu accès gratuitement aux outils Power, cependant je n'y ai maintenant plus accès. Ainsi si vous désirez voir l'application fonctionner, vous pouvez télécharger son code ci-dessous si vous possédez un accès à PowerApps et aux listes SharePoint.</p>",
                "<p><a class=\"lienTelechargeable\" href=\"Info_Projets/codename_documents.zip\" download=\"CodeName.zip\">CodeName.zip</a></p>"]
    },
    "MySmallLibrary": {
        "titre": "Développement d'une application de bibliothèque en React",
        "comp_tech": ["React","HTML","CSS","CloudFare"],
        "info_comp": ["<p>Après la requête d'une amie, j'ai réalisé une application React nommée \"My Small Library\", permettant de renseigner des passages que l'on a aimés dans des livres.</p>",
                "<p>J'ai tout d'abord commencé par réfléchir au visuel de l'application et j'ai réalisé tous les assets visuels, ainsi que la police d'écriture moi-même afin d'avoir un style pixel art.</p>",
                "<p>Pour les éléments visuels, j'ai utilisé le site <a href=\"https://www.pixilart.com/draw\" target=\"_blank\">PixilArt</a>, et pour la police d'écriture j'ai utilisé le site <a href=\"https://www.pentacom.jp/pentacom/bitfontmaker2/\" target=\"_blank\">BitFontMaker 2</a>.</p>",
                "<p>Une partie du visuel de l'application est visible ci-dessous :</p>",
                "<div class=\"images\"><img src=\"Info_Projets/Images/MySmallLibrary/index.png\" alt=\"index\" width=\"40%\"><img src=\"Info_Projets/Images/MySmallLibrary/popup.png\" alt=\"popup\" width=\"40%\"></div>",
                "<p>L'application finale comporte les fonctionnalités suivantes :</p>",
                "<p>&ensp;&ensp;- Connection / déconnexion des utilisateurs</p>",
                "<p>&ensp;&ensp;- Ajout, modification et suppression de livres</p>",
                "<p>&ensp;&ensp;- Ajout, modification et suppression de passages dans les livres</p>",
                "<p>Les données de l'application (utilisateurs et livres) sont stockées et mises à disposition de mon application grâce à l'outil CloudFare. Il n'y aura pas de problèmes de stockage dans un avenir proche puisque l'application ne stocke que des données textuelles. Cependant, CloudFare ayant parfois des problèmes il peut arriver que des problèmes de connexion apparaissent.</p>",
                "<p>Il est possible de tester l'application grâce au lien suivant et au compte test suivant, il est également possible de créer un nouveau compte:</p>",
                "<p>&ensp;&ensp;- Identifiant : aluso</p>",
                "<p>&ensp;&ensp;- Mot de passe : Pass123</p>",
                "<p><a href=\"https://dubiefe.github.io/Library\" target=\"_blank\">Pour consulter l'application, cliquez sur ce lien.</a></p>",
                "<p><a href=\"https://github.com/dubiefe/Library\" target=\"_blank\">Pour consulter le GitHub du projet, cliquez sur ce lien.</a></p>"]
    }
}